/* 
   Application.strings
   Affrus

   Created by Mark Alldritt on 10-04-07.
   Copyright 2010 Late Night Software Ltd.. All rights reserved.
 */


/* Application */

"Cancel" = "Cancel";
"OK" = "OK";
"Run" = "Run";
"Stop" = "Stop";
"FileTemplates" = "Script Templates";
"AppleTemplates" = "Apple Templates";
"UserTemplates" = "User Templates";
"NewScript" = "New Script";
"NewScriptMessage" = "Choose a template for your new script:";
"CreateScript" = "Choose";

"ShowLastError" = "Show Last Error";
"ShowLastErrorTooltip" = "Show the last script error.";
"AppleEventLog" = "Apple Event Log";
"CompilationError" = "AppleScript Compile Error";
"ExecutionError" = "Execution Error";
"NoResult" = "No Result";
"ShowVariables" = "Show Variables";
"HideVariables" = "Hide Variables";
"ToggleVariables" = "Toggle Variables";
"ChevronSyntaxToolbar" = "Show Raw Syntax";
"Debugging" = "Debugging";
"StepOver" = "Step Over";
"StepOverTooltip" = "Step over the next statement in the script.";
"StepInto" = "Step Into";
"StepIntoTooltip" = "Step into the handler called in the next statement.";
"StepOut" = "Step Out";
"StepOutTooltip" = "Step over the statements in the current handler and then pause.";
"ShiftLeft" = "Shift Left";
"ShiftLeftTooltip" = "Shift selected lines left one tab stop.";
"ShiftRight" = "Shift Right";
"ShiftRightTooltip" = "Shift selected lines right one tab stop.";
"Comment" = "Comment";
"CommentTooltip" = "Comment out selected lines.";
"Uncomment" = "Uncomment";
"UncommentTooltip" = "Uncomment selected lines.";
"Entab" = "Entab";
"EntabTooltip" = "Convert spaces to tabs.";
"Detab" = "Detab";
"DetabTooltip" = "Convert tabs to spaces.";
"Stop" = "Stop";
"StopTooltip" = "Stop running or recording.";
"Stopped" = "Stopped";
"Execute" = "Execute";
"ExecuteTooltip" = "Begin or continue executing.";
"Resume" = "Resume";
"Record" = "Record";
"RecordTooltip" = "Start recording Apple Events.";
"Save" = "Save";
"Pause" = "Pause";
"PauseTooltip" = "Pause execution at the next statement.";
"Paused" = "Paused";
"Running" = "Running";
"Tracing" = "Tracing";
"Close" = "Close";
"Compile" = "Compile";
"CompileTooltip" = "Compile the script.";
"Open" = "Open";
"Saving" = "Saving";
"Recompile" = "Recompile";
"CheckSyntax" = "Compile";
"FlattenScript" = "Flatten Script";
"ActivateApplet" = "Activate Applet";
"QuitAppletAndSave" = "Quit Applet & Save";
"EnableStayOpenAndSave" = "Enable Stay Open & Save";
"Enable32BitAndSave" = "Enable 32-Bit Only & Save";
"Disable32BitAndSave" = "Disable 32-Bit Only & Save";
"ClearImplicitTell" = "Clear Implicit Tell";
"ClearMenu" = "Clear Menu";
"Evaluate" = "Evaluate";
"CompileForChevronSyntax" = "Uncompiled Script";
"CompileForChevronSyntaxMessage" = "In order to display the altered syntax, it is necessary to compile the script.";
"ClearBreakpoint" = "Clear Breakpoint";
"SetBreakpoint" = "Set Breakpoint";
"SetTempBreakpoint" = "Set Temporary Breakpoint";
"TellTargetNotRunning" = "Tell Target Not Running";
"Manfiest" = "Manifest";
"ManifestTooltip" = "Show the applications and scripting additions this script depends upon.";
"AppleEventLog" = "Apple Event Log";
"AppleEventLogTooltip" = "Show the Apple Event Log window.";
"DisplayingAppleEventsStatus" = "Displaying Apple Events...";
"PreparingToExecuteStatus" = "Preparing to execute...";
"PreparingToSaveStatus" = "Preparing to Save...";
"EstablishingBreakpointsStatus" = "Establishing Breakpoints...";
"EstablishingParentScriptStatus" = "Establishing Parent Script...";
"ReadingLibrariesStatus" = "Reading Libraries...";
"CompilingFlattenedScriptStatus" = "Compiling Flattened Script...";
"SavingFlattenedScriptStatus" = "Saving Flattened Script...";
"SavingStatus" = "Saving...";
"InflatingScriptStatus" = "Preparing Script...";
"PreparingToDisplaySource" = "Preparing to get source text...";
"GettingSource" = "Getting source text...";
"ReadingScript" = "Reading ‘%@’...";
"LoadingScript" = "Loading Script";
"Leaks" = "Leaks";
"LeaksTooltip" = "Show leaked resources.";
"TellTargetNotRunningMessage" = "The application “%@” is defined as the implict tell target for this script.\n\nDo you want to launch “%@” in order to run this script?";
"OpenEventHandlerMessage" = "Select files and folders to pass to the open handler:";
"FolderActionEventHandlerFoldersMessage" = "Select a folder to pass to the %@ handler:";
"FolderActionEventHandlerVolumesMessage" = "Select a volume or folder to pass to the %@ handler:";
"FolderActionEventHandlerMessage" = "Select files or folders to pass to the %@ handler:";
"NotAppleScript" = "Not An AppleScript Script";
"NotAppleScriptMessage" = "Script Debugger only edits AppleScript scripts.  “%@” appears to be written using another scripting system.\n\nDo you want to open this script in Apple's AppleScript Editor instead?";
"NotSupportedApplet" = "Unsupported Applet/Droplet Document";
"NotSupportedAppletMessage" = "Script Debugger is unable to open “%@” because it does not appear to be a standard AppleScript applet or droplet.\n\nDo you want to open this script in Apple's AppleScript Editor instead?";
"OpenInScriptEditor" = "Open in AppleScript Editor";
"TextFileType" = "Text";
"MissingTemplate" = "The default template script cannot be found.";
"MissingTemplateReason" = "Please choose another default template using the General preferences panel.";
"CompiledDataForkFileType" = "Compiled Script (Data-Fork)";
"CompiledResourceForkFileType" = "Compiled Script (Resource-Fork)";
"CompiledBundleFileType" = "Compiled Script (Bundle)";
"ApplicationBundleFileType" = "Application (Bundle)";
"ApplicationCarbonFileType" = "Application (Carbon)";
"ApplicationClassicFileType" = "Application (Classic)";
"CannotEnableDisableBreakpoints" = "Cannot enable or disable breakpoints";
"CannotEnableDisableBreakOnExceptions" = "Cannot enable or disable break on exceptions";
"FailedToChangeLanguage" = "Failed to Change Language";
"FailedToChangeLanguageMessage" = "%@ when switching to %@";
"CannotChangeLanguage" = "Cannot Change Language";
"CannotChangeLanguageMessage" = "A script's language cannot be changed while the script is running.";
"CannotChangeRunningLanguage" = "Cannot Change Language";
"CannotChangeRunningLanguageMessage" = "A script's language cannot be changed while the script is running.";
"FileIsInTheTrash" = "File Is In The Trash";
"FileIsInTheTrashMessage" = "Cannot open “%@” because it is presently in the trash";
"CannotReadDocument" = "Cannot Read Document";
"CannotWriteDocument" = "Cannot Save Document";
"CannotSaveAsText" = "Cannot Save As Text";
"AppletNotResponding" = "Applet Not Responding";
"AppletNotRespondingMessage" = "“%@” is not responding to the quit command.";
"CannotQuitApplet" = "Cannot quit applet";
"AppletRunning" = "Applet Running";
"AppletRunningMessage" = "Cannot save document “%@” because it is currently running in another process.";
"CreatingStayOpenScript" = "Creating a Stay Open applet?";
"CreatingStayOpenScriptMessage" = "This script has an idle handler, but it is not set to stay open when running as an applet.\n\nIn order for the idle handler to be called, the script must have the Stay Open option enabled.";
"Creating32BitScript" = "Creating a 32-Bit Only applet?";
"Creating32BitScriptMessage" = "This script uses 32-bit scripting additions (i.e. scripting additions that have not been updated to be fully compatible with 64-bit Macintosh computers running Snow Leopard), but the script is not configured to run in 32-bit mode on 64-bit Macintoshes.\n\nIn order for 32-bit scripting additions to operate correctly on 64-bit Macintoshes, the script must have the 32-Bit Only option enabled.";
"Creating64BitScript" = "Creating a 64-Bit Only applet?";
"Creating64BitScriptMessage" = "This script is configured to run in 32-bit mode on 64-bit Macintoshes, but does not depend on 32-bit scripting additions.\n\nDo you want to disable 32-Bit Only mode and take full advantage of 64-bit Macintoshes?";
"ExportRunOnly" = "Export Run-Only";
"ExportRunOnlyTooltip" = "Create a copy of this script with all source code removed.";
"ExportRunOnlyLabel" = "Export As:";
"ExportRunOnlyPrompt" = "Export";
"ExportRunOnlyNameTemplate" = "%@ Run-Only";
"CannotExportRunOnly" = "Cannot Export Run-Only";
"RecompileAndSave" = "Recompile & Save";
"MoreHelp" = "More Help";
"RecompileAndSaveMessage" = "AppleScript failed to save this document because the script code, or data contained in global variables or properties, exceeds AppleScript's internal limits (errOSAInternalTableOverflow).\n\nClearing global variables and properties by recompiling the script may allow AppleScript to save the script.  Do you want to recompile and save again?";
"RecompileAndSaveMessage2" = "AppleScript failed to save this document because the script contains variables holding AppleScript Objective-C pointer values which cannot be saved (errOSACantStorePointers).\n\nClearing global variables and properties by recompiling the script allows AppleScript to save the script.  Do you want to recompile and save again?";
"ManifestReportNameTemplate" = "%@ Manifest.txt";
"ManifestXMLNameTemplate" = "%@ Manifest.xml";
"RevertRunning" = "Running";
"RevertRunningMessage" = "This script is currently running.  The script must be stopped before changes can be made.\n\nDo you want to stop the script?";
"CannotCompileLibrary" = "Cannot Compile Library";
"CannotCompileLibraryMessage" = "The “%@” library failed to compile";
"CannotFindLibrary" = "Cannot Find Library";
"CannotFindLibraryMessage" = "The “%@” library script could not be located";
"CannotUseLibrary" = "Cannot Use Library";
"CannotUseLibraryMessage" = "The following libraries are unusable because they are compiled with debugging enabled:\n\n%@";
"CannotGenerateManifest" = "Cannot Generate Manifest";
"RuntimeError" = "Runtime Error";
"UnknownRuntimeErrorMessage" = "No error message available.";
"CompilingLibrariesStatus" = "Compiling Libraries...";
"CopyingLibrariesStatus" = "Copying Libraries...";
"CompilingLibraryXStatus" = "Compiling Library “%@”...";
"CopyingLibraryXStatus" = "Copying Library “%@”...";
"CompilingStatus" = "Compiling...";
"CompiledStatus" = "Compiled";
"CompiledStatus" = "Compiled";
"StoppedStatus" = "Stopped";
"StoppingStatus" = "Stopping...";
"StartingStatus" = "Starting...";
"RunningStatus" = "Running";
"TracingStatus" = "Tracing";
"RecordingStatus" = "Recording";
"ErrorStatus" = "Error";
"QuickLook" = "Quick Look";
"CompileFailedStatusTemplate" = "Compile Error: %@";
"StoppedWithErrorStatusTemplate" = "Stopped (Error: %@)";
"DurationStatusTemplate" = "Duration: %@, AppleScript: %@, Apple Events: %@ (%d)";
"BreakpointStatusTemplate" = "Breakpoint, Duration: %@, AppleScript: %@, Apple Events: %@ (%d)";
"BreakpointIIStatusTemplate" = "Paused at breakpoint (hit count: %d) - %@ - line %d %@";
"BreakpointIIIStatusTemplate" = "Paused at breakpoint (hit count: %d) - line %d %@";
"BreakpointIINoteTemplate" = "Breakpoint (hit count: %d) - %@ - line %d %@";
"BreakpointIIINoteTemplate" = "Breakpoint (hit count: %d) - line %d %@";
"ExceptionStatusTemplate" = "Paused at exception: %@";
"PausedStatusTemplate" = "Paused";
"CompileFailedStatus" = "Compile failed";
"InternalFailureStatus" = "Internal failure";
"CannotCompile" = "Cannot Compile Script";
"CannotExecute" = "Cannot Execute";
"CannotStop" = "Cannot Stop Script";
"CannotLaunch" = "Cannot Launch %@";
"CannotLaunchTellTarget" = "Cannot Launch Tell Target";
"CannotClearBreakpoint" = "Cannot clear breakpoint";
"CannotSetBreakpoint" = "Cannot set breakpoint";
"ExportFlattened" = "Export Flattened";
"ExportFlattenedLabel" = "Flatten As:";
"ExportFlattenedPrompt" = "Export";
"CannotExportFlattened" = "Cannot Export Flattened";
"ParentDebugable" = "Parent Script Has Debugging Enabled";
"ParentDebugableMessage" = "It is not possible to run this script because its parent script (“%@”) has debugging enabled.";
"CloseParentScript" = "Parent Script";
"CloseParentScriptMessage" = "This document is used by %@ as %s parent script.  Do you want to continue closing the script?";
"EditRunningScript" = "Script Running";
"EditRunningScriptMessage" = "“%@” is currently running.  The script must be stopped before changes can be made.\n\nDo you want to stop the script?";
"OpenLaunchesApps" = "Launch Applications?";
"OpenLaunchesAppsMessage1" = "Opening “%@” may cause the following application to launch:\n\n%@\n\nDo you want to continue opening this script?";
"OpenLaunchesAppsMessage1Plural" = "Opening “%@” may cause the following applications to launch:\n\n%@\n\nDo you want to continue opening this script?";
"OpenLaunchesAppsMessage2" = "Opening “%@” may cause the following application to launch:\n\n%@\n\nDo you want to continue opening this script?  Alternatively, you can open the script as uncompiled text to avoid launching any applications.";
"OpenLaunchesAppsMessage2Plural" = "Opening “%@” may cause the following applications to launch:\n\n%@\n\nDo you want to continue opening this script?  Alternatively, you can open the script as uncompiled text to avoid launching any applications.";
"Recover" = "Recover";
"RecoverScript" = "Recover Script";
"OpenAsText" = "Open As Text";
"andXTemplate" = " and %@";
"commaXTemplate" = ", %@";
"its" = "its";
"their" = "their";
"NoParentScript" = "none";
"unknown" = "unknown";
"CopyEvent" = "Copy Event";
"CopyReply" = "Copy Event Result";
"ShowAllEvents" = "Show All Events";
"ImplicitTell" = "Implicit Tell";
"ImplicitTellTooltip" = "Set the default tell target for the script.";
"ParentScript" = "Parent Script";
"ParentScriptTooltip" = "Set the parent script for this script";
"QuitApplication" = "Quit Application";
"ActivateApplication" = "Activate Application";
"ShowResultInViewer" = "Show Result Explorer Window";
"ShowDiagram" = "Show Diagram";
"OpenAppDictionary" = "Open “%@” Dictionary";
"SaveDefaultScriptWindowState" = "Set Default Script Size & State";
"CannotSaveDefaultScriptWindowState" = "Cannot save defaults.";
"RestoreDefaultScriptWindowState" = "Reset Default Script Size & State";
"SaveDefaultEventLogWindowState" = "Set Default Event Log Size & State";
"RestoreDefaultEventLogWindowState" = "Reset Default Event Log Size & State";
"EditWithBBEdit" = "Edit With %@...";
"EditWithBBEditMessage" = "The content of “%@” is being edited in %@.\n\nClose the corresponding %@ document or press the Cancel button to abandon changes made in %@.";
"BreakOnExceptions" = "Exceptions";
"BreakOnExceptionsTooltip" = "Toggle pause on exceptions";
"BreakOnBreakpoints" = "Breakpoints";
"BreakOnBreakpointsTooltip" = "Toggle pause at breakpoints";
"Trace" = "Trace";
"TraceTooltip" = "Step repeatedly.";
"TraceSpeed" = "Trace Speed";
"OpenScriptXInNewWindow" = "Open “%@” in New Window";
"ScriptRunning" = "Script Running";
"ScriptRunningMessage" = "“%@” is currently running.  Do you want to stop the script and close the window?";
"StopAndClose" = "Stop & Close";
"ScriptTimer" = "Timer";
"ShowAppleEventLog" = "Show Event Log";
"HideAppleEventLog" = "Hide Event Log";
"AppendAppleEventLog" = "Append to Log";
"NoAppendAppleEventLog" = "Append To Log";
"ShowLogResultViewer" = "Show Event Log Result Explorer";
"HideLogResultViewer" = "Hide Event Log Result Explorer";
"DebuggerTab" = "Result & Variables";
"ResourcesTab" = "Resources";
"InspectorsTab" = "Inspectors";
"RootObjectSpecifier" = "application";
"ShowDefinition" = "Show Definition";
"ShowXDefinitionInY" = "Show definition for “%@” in “%@”";
"ShowTabBar" = "Show Tab Bar";
"HideTabBar" = "Hide Tab Bar";
